Конфигурация/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЧекККМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоДисконтнымКартам</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Comment>Физическое лицо предприниматель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФОП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Штрихкоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/HTTPServices/ТоварыАПИ/Ext/Module.bsl
#Область ОбработчикиСобытий

// Обработчик GET-запроса поиска товара.
// URL: /api/search?code=<код_или_штрихкод>
//
// Параметры:
//  Запрос - HTTPСервисЗапрос - входящий HTTP-запрос.
//
// Возвращаемое значение:
//  HTTPСервисОтвет - ответ с JSON-телом.
//
Функция ПоискТовараGET(Запрос)
	
	СтрокаПоиска = Запрос.ПараметрыЗапроса.Получить("code");
	
	Если СтрокаПоиска = Неопределено ИЛИ ПустаяСтрока(СтрокаПоиска) Тогда
		Возврат СформироватьОтветОшибки(400, "Не указан параметр code");
	КонецЕсли;
	
	СтрокаПоиска = СокрЛП(СтрокаПоиска);
	
	НайденныеТовары = НайтиТов))арыПоКоду(Стр)окаПоиска);
	
	Если НайденныеТовары.Количество() = 0 Тогда
		Возврат СформироватьОтветОшибки(404, "Товар не найден по запросу: " + СтрокаПоиска);
	КонецЕсли;
	
	МассивТоваров = Новый Массив;
	
	Для Каждого Товар Из НайденныеТовары Цикл
		ДанныеТовара = ПолучитьДанныеТовара(Товар);
		МассивТоваров.Добавить(ДанныеТовара);
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("success", Истина);
	Результат.Вставить("count", МассивТоваров.Количество());
	Результат.Вставить("items", МассивТоваров);
	
	Возврат СформироватьОтветJSON(200, Результат);
	
КонецФункции

// Обработчик GET-запроса синхронизации товаров.
// URL: /api/goods/sync
//
// Параметры:
//  Запрос - HTTPСервисЗапрос - входящий HTTP-запрос.
//
// Возвращаемое значение:
//  HTTPСервисОтвет - ответ с JSON-массивом товаров.
//
Функция СинхронизацияТоваровGE))T(Запр)о)с))
	
	Попытка
		МассивТоваров = ПолучитьВсеТоварыДляСинхронизации();
		
		Результат = Новый Структура;
		Результат.Вставить("success", Истина);
		Результат.Вставить("count", МассивТоваров.Количество());
		Результат.Вставить("items", МассивТоваров);
		
		Возврат СформироватьОтветJSON(200, Результат);
	Исключение
		Возврат СформироватьОтветОшибки(500, "Ошибка синхронизации: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

// Обработчик POST-запроса приема чека с кассы.
// URL: /api/check
//
// Параметры:
//  Запрос - HTTPСервисЗапрос - входящий HTTP-запрос с JSON-телом.
//
// Возвращаемое значение:
//  HTTPСервисОтвет - ответ с результатом создания чека.
//
Функция ПриёмЧекаPOST(Запрос)
	
	Попытка
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
		
		Если ПустаяСтрока(ТелоЗапроса) Тогда
			Возврат СформироватьОтветОшибки(400, "Пустое тело запроса");
		КонецЕсли;
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
		ДанныеЧека = ПрочитатьJSON(ЧтениеJSON, Истина);
		ЧтениеJSON.Закрыть();
		
		РезультатСоздания = СоздатьЧекККМИзJSON(ДанныеЧека);
		
		Возврат СформироватьОтветJSON(200, РезультатСоздания);
	Исключение
		Возврат СформироватьОтветОшибки(500, "Ошибка приема чека: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Поиск товаров по коду/штрихкоду/артикулу.
// Логика аналогична ОбщегоНазначения.НайтиТовар.
//
// Параметры:
//  СтрокаПоиска - Строка - код, штрихкод или артикул.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.Номенклатура - найденные товары.
//
Функция НайтиТоварыПоКоду(Знач СтрокаПоиска)
	
	Результат = Новый Массив;
	
	// ЭТАП 1: Поиск по штрихкоду (без фильтра ПометкаУдаления - аналог НайтиТовар)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Штрихкоды.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Штрихкод = &СтрокаПоиска";
	
	Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
	ТаблицаРезультатов = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаРезультатов.Количество() > 0 Тогда
		Для Каждого Строка Из ТаблицаРезультатов Цикл
			Результат.Добавить(Строка.Номенклатура);
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
	
	// ЭТАП 2: Поиск по Коду или Артикулу
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Код = &СтрокаПоиска
		|	И НЕ Номенклатура.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &СтрокаПоиска
		|	И НЕ Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
	ТаблицаРезультатов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из ТаблицаРезультатов Цикл
		Результат.Добавить(Строка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает полные данные товара для ответа API.
//
// Параметры:
//  НоменклатураСсылка - СправочникСсылка.Номенклатура - ссылка на товар.
//
// Возвращаемое значение:
//  Структура - данные товара для сериализации в JSON.
//
Функция ПолучитьДанныеТовара(НоменклатураСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Код КАК Код,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.Артикул КАК Артикул,
		|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Номенклатура.СтавкаНДС КАК СтавкаНДС,
		|	Номенклатура.КодУКТЗЕД КАК КодУКТЗЕД,
		|	Номенклатура.ТребуетАкцизнуюМарку КАК ТребуетАкцизнуюМарку,
		|	Номенклатура.ПроцентНаценки КАК ПроцентНаценки
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", НоменклатураСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат Новый Структура("error", "Ошибка чтения данных товара");
	КонецЕсли;
	
	Цена = ОбщегоНазначения.ПолучитьРозничнуюЦену(ТекущаяДатаСеанса(), НоменклатураСсылка);
	МассивШтрихкодов = ПолучитьШтрихкодыНоменклатуры(НоменклатураСсылка);
	
	ДанныеТовара = Новый Структура;
	ДанныеТовара.Вставить("code", СокрЛП(Выборка.Код));
	ДанныеТовара.Вставить("name", СокрЛП(Выборка.Наименование));
	ДанныеТовара.Вставить("article", СокрЛП(Выборка.Артикул));
	ДанныеТовара.Вставить("unit", Строка(Выборка.ЕдиницаИзмерения));
	ДанныеТовара.Вставить("vatRate", Строка(Выборка.СтавкаНДС));
	ДанныеТовара.Вставить("codeUKTZED", СокрЛП(Выборка.КодУКТЗЕД));
	ДанныеТовара.Вставить("requiresExciseStamp", Выборка.ТребуетАкцизнуюМарку);
	ДанныеТовара.Вставить("markupPercent", Выборка.ПроцентНаценки);
	ДанныеТовара.Вставить("price", Цена);
	ДанныеТовара.Вставить("barcodes", МассивШтрихкодов);
	
	Возврат ДанныеТовара;
	
КонецФункции

// Получает штрихкоды номенклатуры.
//
// Параметры:
//  НоменклатураСсылка - СправочникСсылка.Номенклатура - ссылка на товар.
//
// Возвращаемое значение:
//  Массив из Строка - массив штрихкодов.
//
Функция ПолучитьШтрихкодыНоменклатуры(НоменклатураСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Номенклатура = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", НоменклатураСсылка);
	МассивШтрихкодов = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивШтрихкодов.Добавить(Выборка.Штрихкод);
	КонецЦикла;
	
	Возврат МассивШтрихкодов;
	
КонецФункции

// Формирует HTTP-ответ с JSON телом.
//
// Параметры:
//  КодСостояния - Число - HTTP-код (200, 400, 404, 500).
//  Данные - Структура - данные для сериализации.
//
// Возвращаемое значение:
//  HTTPСервисОтвет - ответ сервиса.
//
Функция СформироватьОтветJSON(КодСостояния, Данные)
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	Ответ.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());
	
	Возврат Ответ;
	
КонецФункции

// Формирует ответ с ошибкой.
//
// Параметры:
//  КодСостояния - Число - HTTP-код ошибки.
//  Сообщение - Строка - текст ошибки.
//
// Возвращаемое значение:
//  HTTPСервисОтвет - ответ с ошибкой.
//
Функция СформироватьОтветОшибки(КодСостояния, Сообщение)
	
	Данные = Новый Структура;
	Данные.Вставить("success", Ложь);
	Данные.Вставить("error", Сообщение);
	
	Возврат СформироватьОтветJSON(КодСостояния, Данные);
	
КонецФункции

// Получает все активные товары с ценами и штрихкодами (пакетный запрос).
//
// Возвращаемое значение:
//  Массив из Структура - массив данных товаров.
//
Функция ПолучитьВсеТоварыДляСинхронизации()
	
	МассивТоваров = Новый Массив;
	
	// Все элементы (не группы, не удаленные)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Код КАК Код,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.Артикул КАК Артикул,
		|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Номенклатура.СтавкаНДС КАК СтавкаНДС,
		|	Номенклатура.КодУКТЗЕД КАК КодУКТЗЕД,
		|	Номенклатура.ТребуетАкцизнуюМарку КАК ТребуетАкцизнуюМарку,
		|	Номенклатура.ПроцентНаценки КАК ПроцентНаценки
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И НЕ Номенклатура.ЭтоГруппа";
	
	ВыборкаТоваров = Запрос.Выполнить().Выбрать();
	
	// Пакетный запрос ВСЕХ штрихкодов (не в цикле)
	ЗапросШК = Новый Запрос;
	ЗапросШК.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Номенклатура КАК Номенклатура,
		|	Штрихкоды.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды";
	
	ТаблицаШК = ЗапросШК.Выполнить().Выгрузить();
	
	// Группировка штрихкодов по номенклатуре
	СоответствиеШК = Новый Соответствие;
	Для Каждого СтрокаШК Из ТаблицаШК Цикл
		Ключ = СтрокаШК.Номенклатура;
		МассивШК = СоответствиеШК.Получить(Ключ);
		Если МассивШК = Неопределено Тогда
			МассивШК = Новый Массив;
			СоответствиеШК.Вставить(Ключ, МассивШК);
		КонецЕсли;
		МассивШК.Добавить(СтрокаШК.Штрихкод);
	КонецЦикла;
	
	// Формирование результата
	Пока ВыборкаТоваров.Следующий() Цикл
		
		Цена = ОбщегоНазначения.ПолучитьРозничнуюЦену(ТекущаяДатаСеанса(), ВыборкаТоваров.Ссылка);
		
		МассивШтрихкодов = СоответствиеШК.Получить(ВыборкаТоваров.Ссылка);
		Если МассивШтрихкодов = Неопределено Тогда
			МассивШтрихкодов = Новый Массив;
		КонецЕсли;
		
		ДанныеТовара = Новый Структура;
		ДанныеТовара.Вставить("code", СокрЛП(ВыборкаТоваров.Код));
		ДанныеТовара.Вставить("name", СокрЛП(ВыборкаТоваров.Наименование));
		ДанныеТовара.Вставить("article", СокрЛП(ВыборкаТоваров.Артикул));
		ДанныеТовара.Вставить("unit", Строка(ВыборкаТоваров.ЕдиницаИзмерения));
		ДанныеТовара.Вставить("vatRate", Строка(ВыборкаТоваров.СтавкаНДС));
		ДанныеТовара.Вставить("codeUKTZED", СокрЛП(ВыборкаТоваров.КодУКТЗЕД));
		ДанныеТовара.Вставить("requiresExciseStamp", ВыборкаТоваров.ТребуетАкцизнуюМарку);
		ДанныеТовара.Вставить("markupPercent", ВыборкаТоваров.ПроцентНаценки);
		ДанныеТовара.Вставить("price", Цена);
		ДанныеТовара.Вставить("barcodes", МассивШтрихкодов);
		
		МассивТоваров.Добавить(ДанныеТовара);
		
	КонецЦикла;
	
	Возврат МассивТоваров;
	
КонецФункции

// Создает и проводит документ ЧекККМ на основе данных из JSON.
//
// Параметры:
//  ДанныеЧека - Соответствие - данные чека из JSON.
//
// Возвращаемое значение:
//  Структура - результат создания: success, number, ref.
//
Функция СоздатьЧекККМИзJSON(ДанныеЧека)
	
	Если ДанныеЧека["items"] = Неопределено Тогда
		Возврат РезультатОшибки("Не указаны товары (items)");
	КонецЕсли;
	
	Склад = НайтиСкладИзДанных(ДанныеЧека);
	Касса = НайтиКассуИзДанных(ДанныеЧека);
	
	// Подготовка документа (до транзакции)
	НовыйЧек = Документы.ЧекККМ.СоздатьДокумент();
	ЗаполнитьШапкуЧека(НовыйЧек, ДанныеЧека, Склад, Касса);
	
	// Заполнение ТЧ Товары
	РезультатТоваров = ЗаполнитьТоварыЧека(НовыйЧек, ДанныеЧека);
	Если НЕ РезультатТоваров.Успех Тогда
		Возврат РезультатОшибки(РезультатТоваров.Ошибка);
	КонецЕсли;
	
	НовыйЧек.СуммаДокумента = РезультатТоваров.СуммаДокумента;
	
	// Заполнение ТЧ Оплата
	ЗаполнитьОплатуЧека(НовыйЧек, ДанныеЧека, РезультатТоваров.СуммаДокумента, Касса);
	
	// Запись и проведение в транзакции
	НачатьТранзакцию();
	Попытка
		НовыйЧек.Записать(РежимЗаписиДокумента.Проведение);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Возврат РезультатОшибки("Ошибка записи чека: " + ОписаниеОшибки());
	КонецПопытки;
	
	Результат = Новый Структура;
	Результат.Вставить("success", Истина);
	Результат.Вставить("number", НовыйЧек.Номер);
	Результат.Вставить("ref", Строка(НовыйЧек.Ссылка.УникальныйИдентификатор()));
	Результат.Вставить("date", Формат(НовыйЧек.Дата, "ДФ=yyyy-MM-ddTHH:mm:ss"));
	Результат.Вставить("amount", НовыйЧек.СуммаДокумента);
	
	Возврат Результат;
	
КонецФункции

// Заполняет шапку документа ЧекККМ.
//
// Параметры:
//  НовыйЧек - ДокументОбъект.ЧекККМ - создаваемый документ.
//  ДанныеЧека - Соответствие - данные из JSON.
//  Склад - СправочникСсылка.Склады - склад.
//  Касса - СправочникСсылка.Кассы - касса.
//
Процедура ЗаполнитьШапкуЧека(НовыйЧек, ДанныеЧека, Склад, Касса)
	
	НовыйЧек.Дата = ТекущаяДатаСеанса();
	
	Если ДанныеЧека["date"] <> Неопределено Тогда
		ДатаЧека = ДатаИзСтроки(Строка(ДанныеЧека["date"]));
		Если ЗначениеЗаполнено(ДатаЧека) Тогда
			НовыйЧек.Дата = ДатаЧека;
		КонецЕсли;
	КонецЕсли;
	
	НовыйЧек.Склад = Склад;
	НовыйЧек.Статус = Перечисления.СтатусыЧекаККМ.НеФискальный;
	
	Если ЗначениеЗаполнено(Касса) Тогда
		НовыйЧек.Касса = Касса;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет ТЧ Товары документа ЧекККМ.
//
// Параметры:
//  НовыйЧек - ДокументОбъект.ЧекККМ - создаваемый документ.
//  ДанныеЧека - Соответствие - данные из JSON.
//
// Возвращаемое значение:
//  Структура - Успех (Булево), СуммаДокумента (Число), Ошибка (Строка).
//
Функция ЗаполнитьТоварыЧека(НовыйЧек, ДанныеЧека)
	
	Результат = Новый Структура("Успех, СуммаДокумента, Ошибка", Истина, 0, "");
	ТоварыМассив = ДанныеЧека["items"];
	
	Для Каждого ЭлементТовара Из ТоварыМассив Цикл
		
		КодТовара = "";
		Если ЭлементТовара["code"] <> Неопределено Тогда
			КодТовара = Строка(ЭлементТовара["code"]);
		КонецЕсли;
		
		НайденныеТовары = НайтиТоварыПоКоду(КодТовара);
		Если НайденныеТовары.Количество() = 0 Тогда
			Результат.Успех = Ложь;
			Результат.Ошибка = "Товар не найден: " + КодТовара;
			Возврат Результат;
		КонецЕсли;
		
		НоменклатураСсылка = НайденныеТовары[0];
		НоваяСтрока = НовыйЧек.Товары.Добавить();
		НоваяСтрока.Номенклатура = НоменклатураСсылка;
		НоваяСтрока.Количество = БезопасноЧисло(ЭлементТовара["quantity"], 1);
		
		Если ЭлементТовара["price"] <> Неопределено Тогда
			НоваяСтрока.Цена = БезопасноЧисло(ЭлементТовара["price"], 0);
		Иначе
			НоваяСтрока.Цена = ОбщегоНазначения.ПолучитьРозничнуюЦену(ТекущаяДатаСеанса(), НоменклатураСсылка);
		КонецЕсли;
		
		Если ЭлементТовара["amount"] <> Неопределено Тогда
			НоваяСтрока.Сумма = БезопасноЧисло(ЭлементТовара["amount"], 0);
		Иначе
			НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
		КонецЕсли;
		
		Если ЭлементТовара["discountAmount"] <> Неопределено Тогда
			НоваяСтрока.СуммаСкидки = БезопасноЧисло(ЭлементТовара["discountAmount"], 0);
		КонецЕсли;
		
		Если ЭлементТовара["barcode"] <> Неопределено Тогда
			НоваяСтрока.АкцизнаяМарка = Строка(ЭлементТовара["barcode"]);
		КонецЕсли;
		
		Результат.СуммаДокумента = Результат.СуммаДокумента + НоваяСтрока.Сумма;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Заполняет ТЧ Оплата документа ЧекККМ.
//
// Параметры:
//  НовыйЧек - ДокументОбъект.ЧекККМ - создаваемый документ.
//  ДанныеЧека - Соответствие - данные из JSON.
//  СуммаДокумента - Число - общая сумма.
//  Касса - СправочникСсылка.Кассы - касса.
//
Процедура ЗаполнитьОплатуЧека(НовыйЧек, ДанныеЧека, СуммаДокумента, Касса)
	
	Если ДанныеЧека["payments"] <> Неопределено Тогда
		ОплатыМассив = ДанныеЧека["payments"];
		Для Каждого ЭлементОплаты Из ОплатыМассив Цикл
			ДобавитьСтрокуОплаты(НовыйЧек, ЭлементОплаты, Касса);
		КонецЦикла;
	Иначе
		// Оплата не указана - наличные на полную сумму
		НоваяОплата = НовыйЧек.Оплата.Добавить();
		НоваяОплата.ВидОплаты = Перечисления.ВидыОплаты.Наличные;
		НоваяОплата.Сумма = СуммаДокумента;
		Если ЗначениеЗаполнено(Касса) Тогда
			НоваяОплата.КассаОплаты = Касса;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Добавляет строку оплаты из элемента JSON.
//
// Параметры:
//  НовыйЧек - ДокументОбъект.ЧекККМ - создаваемый документ.
//  ЭлементОплаты - Соответствие - данные оплаты из JSON.
//  Касса - СправочникСсылка.Кассы - касса.
//
Процедура ДобавитьСтрокуОплаты(НовыйЧек, ЭлементОплаты, Касса)
	
	НоваяОплата = НовыйЧек.Оплата.Добавить();
	
	ТипОплаты = "";
	Если ЭлементОплаты["type"] <> Неопределено Тогда
		ТипОплаты = Строка(ЭлементОплаты["type"]);
	КонецЕсли;
	
	Если ТипОплаты = "Безналичные" ИЛИ ТипОплаты = "Картой" Тогда
		НоваяОплата.ВидОплаты = Перечисления.ВидыОплаты.Безналичные;
	Иначе
		НоваяОплата.ВидОплаты = Перечисления.ВидыОплаты.Наличные;
	КонецЕсли;
	
	НоваяОплата.Сумма = БезопасноЧисло(ЭлементОплаты["amount"], 0);
	
	Если ЗначениеЗаполнено(Касса) Тогда
		НоваяОплата.КассаОплаты = Касса;
	КонецЕсли;
	
КонецПроцедуры

// Находит склад по данным чека или берет основной из констант.
//
// Параметры:
//  ДанныеЧека - Соответствие - данные из JSON.
//
// Возвращаемое значение:
//  СправочникСсылка.Склады - найденный склад.
//
Функция НайтиСкладИзДанных(ДанныеЧека)
	
	ИмяСклада = "";
	Если ДанныеЧека["warehouse"] <> Неопределено Тогда
		ИмяСклада = Строка(ДанныеЧека["warehouse"]);
	КонецЕсли;
	
	Склад = Справочники.Склады.НайтиПоНаименованию(ИмяСклада);
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Склад = Константы.ОсновнойСклад.Получить();
	КонецЕсли;
	
	Возврат Склад;
	
КонецФункции

// Находит кассу по данным чека.
//
// Параметры:
//  ДанныеЧека - Соответствие - данные из JSON.
//
// Возвращаемое значение:
//  СправочникСсылка.Кассы - найденная касса.
//
Функция НайтиКассуИзДанных(ДанныеЧека)
	
	ИмяКассы = "";
	Если ДанныеЧека["cashRegister"] <> Неопределено Тогда
		ИмяКассы = Строка(ДанныеЧека["cashRegister"]);
	КонецЕсли;
	
	Возврат Справочники.Кассы.НайтиПоНаименованию(ИмяКассы);
	
КонецФункции

// Безопасное преобразование значения в число через ОписаниеТипов.
//
// Параметры:
//  Значение - Произвольный - значение для преобразования.
//  ЗначениеПоУмолчанию - Число - значение при невозможности преобразования.
//
// Возвращаемое значение:
//  Число - результат преобразования.
//
Функция БезопасноЧисло(Значение, ЗначениеПоУмолчанию = 0)
	
	Если Значение = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Значение;
	КонецЕсли;
	
	ОписаниеТипа = Новый ОписаниеТипов("Число");
	Возврат ОписаниеТипа.ПривестиЗначение(Значение);
	
КонецФункции

// Формирует структуру ошибки для ответа.
//
// Параметры:
//  Сообщение - Строка - текст ошибки.
//
// Возвращаемое значение:
//  Структура - структура с success=Ложь и текстом ошибки.
//
Функция РезультатОшибки(Сообщение)
	
	Результат = Новый Структура;
	Результат.Вставить("success", Ложь);
	Результат.Вставить("error", Сообщение);
	
	Возврат Результат;
	
КонецФункции

// Преобразует строку даты ISO в значение Дата.
//
// Параметры:
//  СтрокаДаты - Строка - дата в формате ISO (yyyy-MM-ddTHH:mm:ss).
//
// Возвращаемое значение:
//  Дата - значение даты, или пустая дата при ошибке.
//
Функция ДатаИзСтроки(Знач СтрокаДаты)
	
	Если НЕ ЗначениеЗаполнено(СтрокаДаты) Тогда
		Возврат '00010101';
	КонецЕсли;
	
	СтрокаДаты = СтрЗаменить(СтрокаДаты, "T", "");
	СтрокаДаты = СтрЗаменить(СтрокаДаты, "-", "");
	СтрокаДаты = СтрЗаменить(СтрокаДаты, ":", "");
	СтрокаДаты = СтрЗаменить(СтрокаДаты, " ", "");
	
	Если СтрДлина(СтрокаДаты) >= 14 Тогда
		Возврат Дата(Лев(СтрокаДаты, 14));
	ИначеЕсли СтрДлина(СтрокаДаты) >= 8 Тогда
		Возврат Дата(Лев(СтрокаДаты, 8) + "000000");
	Иначе
		Возврат '00010101';
	КонецЕсли;
	
КонецФункции

#КонецОбласти
